In [41]:
import pandas as pd
import numpy as np

In [25]:
data = [['A','B',3],['B','D','A'],['A',5,'E']]
col = ['col2','col1','col3']
row = ['row1','row2','row3']
df = pd.DataFrame(data = data, index= row, columns = col)
df

     col2 col1 col3
row1    A    B    3
row2    B    D    A
row3    A    5    E

In [26]:
df.sort_values(by='col2',key=lambda col: col.str.lower())

     col2 col1 col3
row1    A    B    3
row3    A    5    E
row2    B    D    A

In [32]:
df1 = pd.DataFrame({'IDX1':['a','b','c','a'],
                   'val':[1,2,3,4]})
df1

  IDX1  val
0    a    1
1    b    2
2    c    3
3    a    4

In [33]:
df2 = pd.DataFrame({'IDX2':['a','c','d'],'VAL':[5,6,7]})
df2

  IDX2  VAL
0    a    5
1    c    6
2    d    7

In [37]:
df1.merge(df2, left_on='IDX1',right_on='IDX2')

  IDX1  val IDX2  VAL
0    a    1    a    5
1    a    4    a    5
2    c    3    c    6

In [42]:
n=np.NaN
col1 = ['col1','col2','col3']
row1 = ['row1','row2','row3']
data1 = [[1,2,3],[5,6,7],[9,n,11]]

col2 = ['col2','col3','col4']
row2 = ['row3','row4','row5']
data2 = [[10,11,12],[14,n,16],[18,19,20]]

df1 = pd.DataFrame(data1,row1,col1)
df2 = pd.DataFrame(data2,row2,col2)

In [48]:
print(df1)
df2

      col1  col2  col3
row1     1   2.0     3
row2     5   6.0     7
row3     9   NaN    11

      col2  col3  col4
row3    10  11.0    12
row4    14   NaN    16
row5    18  19.0    20

In [47]:
print(df1.align(df2,join='outer')[0])
(df1.align(df2,join='outer')[1])

      col1  col2  col3  col4
row1   1.0   2.0   3.0   NaN
row2   5.0   6.0   7.0   NaN
row3   9.0   NaN  11.0   NaN
row4   NaN   NaN   NaN   NaN
row5   NaN   NaN   NaN   NaN

      col1  col2  col3  col4
row1   NaN   NaN   NaN   NaN
row2   NaN   NaN   NaN   NaN
row3   NaN  10.0  11.0  12.0
row4   NaN  14.0   NaN  16.0
row5   NaN  18.0  19.0  20.0